EnumerationCat/STM32F407_FreeRTOS_FATFS_LVGL/GD32H737_LVGL/src/driver/startup_gd32h737vmt6.c
#include "startup_gd32h737vmt6.h"
#include "cmsis_gcc.h"



/* This symbol comes from the linker scirpt. */
extern uint32_t __INITIAL_SP;

/* This symbol comes from cmsis_gcc_m.h, wrapped _start() function. */
extern __NO_RETURN void __PROGRAM_START();



__NO_RETURN void Reset_Handler();
void Default_Handler(void);

/* -------------------------- 异常处理函数声明 -------------------------- */
void NMI_Handler()                      __attribute__((weak));
void HardFault_Handler()                __attribute__((weak));
void MemManage_Handler()                __attribute__((weak));
void BusFault_Handler()                 __attribute__((weak));
void UsageFault_Handler()               __attribute__((weak));
void SVC_Handler()                      __attribute__((weak, alias("Default_Handler")));
void DebugMon_Handler()                 __attribute__((weak, alias("Default_Handler")));
void PendSV_Handler()                   __attribute__((weak, alias("Default_Handler")));
void SysTick_Handler()                  __attribute__((weak, alias("Default_Handler")));

/* -------------------------- 外部中断处理函数声明 -------------------------- */
void WWDGT_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void AVD_LVD_OVD_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void TAMPER_STAMP_LXTAL_IRQHandler()    __attribute__((weak, alias("Default_Handler")));
void RTC_WKUP_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void FMC_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void RCU_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void EXTI0_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void EXTI1_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void EXTI2_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void EXTI3_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void EXTI4_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel0_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel1_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel2_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel3_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel4_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel5_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel6_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void ADC0_1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void EXTI5_9_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER0_BRK_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER0_UP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void TIMER0_TRG_CMT_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void TIMER0_Channel_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void TIMER1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void TIMER2_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void TIMER3_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void I2C0_EV_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void I2C0_ER_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void I2C1_EV_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void I2C1_ER_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void SPI0_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SPI1_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void USART0_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void USART1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void USART2_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void EXTI10_15_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void RTC_Alarm_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void TIMER7_BRK_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER7_UP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void TIMER7_TRG_CMT_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void TIMER7_Channel_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void DMA0_Channel7_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void EXMC_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SDIO0_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void TIMER4_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void SPI2_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void UART3_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void UART4_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void TIMER5_DAC_UDR_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void TIMER6_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel0_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel1_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel2_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel3_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel4_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void ENET0_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void ENET0_WKUP_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel5_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel6_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void DMA1_Channel7_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void USART5_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void I2C2_EV_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void I2C2_ER_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void USBHS0_EP1_OUT_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void USBHS0_EP1_IN_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void USBHS0_WKUP_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void USBHS0_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void DCI_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void CAU_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void HAU_TRNG_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void FPU_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void UART6_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void UART7_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void SPI3_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SPI4_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SPI5_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SAI0_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void TLI_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void TLI_ER_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void IPA_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void SAI1_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void OSPI0_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void I2C3_EV_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void I2C3_ER_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void RSPDIF_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void DMAMUX_OVR_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void HPDF_INT0_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void HPDF_INT1_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void HPDF_INT2_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void HPDF_INT3_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void SAI2_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void TIMER14_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER15_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER16_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void MDIO_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void MDMA_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void SDIO1_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void HWSEM_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void ADC2_IRQHandler()                  __attribute__((weak, alias("Default_Handler")));
void CMP0_1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void CTC_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void RAMECCMU_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void OSPI1_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void RTDEC0_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void RTDEC1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void FAC_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void TMU_IRQHandler()                   __attribute__((weak, alias("Default_Handler")));
void TIMER22_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER23_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER30_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER31_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER40_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER41_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER42_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER43_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER44_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER50_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void TIMER51_IRQHandler()               __attribute__((weak, alias("Default_Handler")));
void USBHS1_EP1_OUT_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void USBHS1_EP1_IN_IRQHandler()         __attribute__((weak, alias("Default_Handler")));
void USBHS1_WKUP_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void USBHS1_IRQHandler()                __attribute__((weak, alias("Default_Handler")));
void ENET1_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void ENET1_WKUP_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void CAN0_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void CAN0_Message_IRQHandler()          __attribute__((weak, alias("Default_Handler")));
void CAN0_Busoff_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void CAN0_Error_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void CAN0_FastError_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void CAN0_TEC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void CAN0_REC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void CAN1_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void CAN1_Message_IRQHandler()          __attribute__((weak, alias("Default_Handler")));
void CAN1_Busoff_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void CAN1_Error_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void CAN1_FastError_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void CAN1_TEC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void CAN1_REC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void CAN2_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void CAN2_Message_IRQHandler()          __attribute__((weak, alias("Default_Handler")));
void CAN2_Busoff_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void CAN2_Error_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void CAN2_FastError_IRQHandler()        __attribute__((weak, alias("Default_Handler")));
void CAN2_TEC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void CAN2_REC_IRQHandler()              __attribute__((weak, alias("Default_Handler")));
void EFUSE_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void I2C0_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void I2C1_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void I2C2_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void I2C3_WKUP_IRQHandler()             __attribute__((weak, alias("Default_Handler")));
void LPDTS_IRQHandler()                 __attribute__((weak, alias("Default_Handler")));
void LPDTS_WKUP_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER0_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER7_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER1_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER2_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER3_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER4_DEC_IRQHandler()            __attribute__((weak, alias("Default_Handler")));
void TIMER22_DEC_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void TIMER23_DEC_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void TIMER30_DEC_IRQHandler()           __attribute__((weak, alias("Default_Handler")));
void TIMER31_DEC_IRQHandler()           __attribute__((weak, alias("Default_Handler")));


#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

// -------------------------- 中断向量表 --------------------------
const VectorType __VECTOR_TABLE[] __VECTOR_TABLE_ATTRIBUTE = {
    // 异常向量（前16项）
    (VectorType)(&__INITIAL_SP),          // 0: 栈顶指针
    Reset_Handler,                        // 1: 复位处理函数
    NMI_Handler,                          // 2: NMI处理函数
    HardFault_Handler,                    // 3: 硬故障处理函数
    MemManage_Handler,                    // 4: 存储管理故障
    BusFault_Handler,                     // 5: 总线故障
    UsageFault_Handler,                   // 6: 使用故障
    0,                                    // 7: 保留
    0,                                    // 8: 保留
    0,                                    // 9: 保留
    0,                                    // 10: 保留
    SVC_Handler,                          // 11: 系统调用
    DebugMon_Handler,                     // 12: 调试监控
    0,                                    // 13: 保留
    PendSV_Handler,                       // 14: 挂起请求
    SysTick_Handler,                      // 15: 系统滴答定时器

